---
kind: property
id: P:Autodesk.Revit.DB.ParameterDownloadOptions.Visible
source: html/b1695ff6-6be6-8b24-3a9f-3bd9d7a83f6d.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.Visible Property

True if the parameter is visible to the user, false if it is hidden and accessible only via the API.

## Syntax (C#)
```csharp
public bool Visible { get; set; }
```